import imgShipping from '../Shared/Assets/img/icons8-in-transit-100.png'
import imgShippingCompany from '../Shared/Assets/img/icons8-shipping-centre-loading-belt-100.png'
export const ReportEntityStyle = [
    { name: 'مشتری', colorLink:"orange", path:"userList" ,id: 1, icon:`url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg'  viewBox='60 0 640 512'%3E%3Cpath d='M224 256c70.7 0 128-57.3 128-128S294.7 0 224 0 96 57.3 96 128s57.3 128 128 128zm89.6 32h-16.7c-22.2 10.2-46.9 16-72.9 16s-50.6-5.8-72.9-16h-16.7C60.2 288 0 348.2 0 422.4V464c0 26.5 21.5 48 48 48h352c26.5 0 48-21.5 48-48v-41.6c0-74.2-60.2-134.4-134.4-134.4zm323-128.4l-27.8-28.1c-4.6-4.7-12.1-4.7-16.8-.1l-104.8 104-45.5-45.8c-4.6-4.7-12.1-4.7-16.8-.1l-28.1 27.9c-4.7 4.6-4.7 12.1-.1 16.8l81.7 82.3c4.6 4.7 12.1 4.7 16.8.1l141.3-140.2c4.6-4.7 4.7-12.2.1-16.8z' fill='orange' /%3E%3C/svg%3E" )`, color: '#ffc457' },
    { name: 'محصولات',colorLink:"CornflowerBlue", path:"productList" , id: 2, icon: `url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg'  viewBox='80 0 640 512'%3E%3Cpath d='M425.7 256c-16.9 0-32.8-9-41.4-23.4L320 126l-64.2 106.6c-8.7 14.5-24.6 23.5-41.5 23.5-4.5 0-9-.6-13.3-1.9L64 215v178c0 14.7 10 27.5 24.2 31l216.2 54.1c10.2 2.5 20.9 2.5 31 0L551.8 424c14.2-3.6 24.2-16.4 24.2-31V215l-137 39.1c-4.3 1.3-8.8 1.9-13.3 1.9zm212.6-112.2L586.8 41c-3.1-6.2-9.8-9.8-16.7-8.9L320 64l91.7 152.1c3.8 6.3 11.4 9.3 18.5 7.3l197.9-56.5c9.9-2.9 14.7-13.9 10.2-23.1zM53.2 41L1.7 143.8c-4.6 9.2.3 20.2 10.1 23l197.9 56.5c7.1 2 14.7-1 18.5-7.3L320 64 69.8 32.1c-6.9-.8-13.5 2.7-16.6 8.9z' fill='CornflowerBlue' /%3E%3C/svg%3E" )`, color: 'skyblue' },
    { name: 'سازمان',colorLink:"Teal", path:"organizationlist" , id: 3, icon:  `url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg'  viewBox='5 0 23 23'%3E%3Cpath d=' M20,3 L20,23 L4,23 L4,3 L20,3 Z M8.042,9 L10.042,9 L10.042,7 L8.042,7 L8.042,9 Z M14,9 L16,9 L16,7 L14,7 L14,9 Z M8.042,15 L10.042,15 L10.042,13 L8.042,13 L8.042,15 Z M10.042,23 L14.042,23 L14.042,19 L10.042,19 L10.042,23 Z M14,15 L16,15 L16,13 L14,13 L14,15 Z M2,3 L22,3 L22,1 L2,1 L2,3 Z' fill='Teal' /%3E%3C/svg%3E" )`, color: 'LightSeaGreen' },
    { name: 'انبار', colorLink:"orange", path:"userList" ,id: 4, icon:`url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg'  viewBox='5 0 512 512'%3E%3Cpath d=' M35.68 54.7l-4.89 17.17 92.71 27.3 5.3 1.53L179 367.4c3.4-1.2 6.9-2.2 10.6-2.9 1.7-.3 3.3-.5 5-.7L142.1 85.03 35.68 54.7zm274.62 59.2l-139.5 26.3 20.4 107.9L330.7 222l-20.4-108.1zm86.6 113.9l-45.2 8.5v.1l-128.5 24.1-28.7 5.4 18.4 98c21.3 3 40.3 15.3 51.8 33.3l158.5-29.8-26.3-139.6zM458 379.1L272.6 414c.9 2.9 1.6 5.8 2.2 8.8.4 2.3.8 4.6 1 6.9l185.1-34.8-2.9-15.8zm-254 2.1c-3.6 0-7.3.3-11.1 1-29.9 5.6-49.5 34.3-43.8 64.2 5.6 30 34.2 49.5 64.2 43.9 30-5.6 49.5-34.2 43.9-64.2-5-26.3-27.5-44.5-53.2-44.9zm-1.6 21.3c15.3.3 29 11.3 32 26.9 3.3 17.7-8.6 35.1-26.4 38.5-17.8 3.3-35.1-8.5-38.5-26.3-3.3-17.8 8.5-35.2 26.3-38.6 2.2-.4 4.4-.6 6.6-.5zm-.2 17.9c-1 0-2 .1-3 .3-8.3 1.6-13.6 9.3-12 17.5 1.5 8.3 9.3 13.6 17.5 12 8.3-1.6 13.5-9.3 12-17.5-1.4-7.3-7.5-12.2-14.5-12.3z' fill='IndianRed' /%3E%3C/svg%3E" )`, color: 'LightCoral' },
    // { name: 'انبارمحصول',colorLink:"orange", path:"/userList" , id: 5, icon: '', color: 'LightCoral' },
    { name: 'تامین ', colorLink:"indianred", path:"supply" ,id: 6, icon:
            `url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg'  viewBox='5 0 512 512'%3E%3Cpath d=' M35.68 54.7l-4.89 17.17 92.71 27.3 5.3 1.53L179 367.4c3.4-1.2 6.9-2.2 10.6-2.9 1.7-.3 3.3-.5 5-.7L142.1 85.03 35.68 54.7zm274.62 59.2l-139.5 26.3 20.4 107.9L330.7 222l-20.4-108.1zm86.6 113.9l-45.2 8.5v.1l-128.5 24.1-28.7 5.4 18.4 98c21.3 3 40.3 15.3 51.8 33.3l158.5-29.8-26.3-139.6zM458 379.1L272.6 414c.9 2.9 1.6 5.8 2.2 8.8.4 2.3.8 4.6 1 6.9l185.1-34.8-2.9-15.8zm-254 2.1c-3.6 0-7.3.3-11.1 1-29.9 5.6-49.5 34.3-43.8 64.2 5.6 30 34.2 49.5 64.2 43.9 30-5.6 49.5-34.2 43.9-64.2-5-26.3-27.5-44.5-53.2-44.9zm-1.6 21.3c15.3.3 29 11.3 32 26.9 3.3 17.7-8.6 35.1-26.4 38.5-17.8 3.3-35.1-8.5-38.5-26.3-3.3-17.8 8.5-35.2 26.3-38.6 2.2-.4 4.4-.6 6.6-.5zm-.2 17.9c-1 0-2 .1-3 .3-8.3 1.6-13.6 9.3-12 17.5 1.5 8.3 9.3 13.6 17.5 12 8.3-1.6 13.5-9.3 12-17.5-1.4-7.3-7.5-12.2-14.5-12.3z' fill='IndianRed' /%3E%3C/svg%3E" )`
        , color: 'LightCoral' },
    { name: 'تامین کنندگان',colorLink:"FireBrick", path:"supplierList" , id: 7, icon:
            `url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg'  viewBox='5 0 512 512'%3E%3Cpath d='  M 384 64 l 0.387 256 H 368 l -96 -128 l -16 128 l -96 -128 l -16 128 l -96 -128 l -16 128 v 160 h 448 V 64 h -32 v 256 h -32 V 64 h -32 Z M 64 352 h 48 v 32 H 64 v -32 Z m 80 0 h 48 v 32 h -48 v -32 Z m 80 0 h 48 v 32 h -48 v -32 Z m 80 0 h 48 v 32 h -48 v -32 Z M 64 416 h 48 v 32 H 64 v -32 Z m 80 0 h 48 v 32 h -48 v ' fill='FireBrick' /%3E%3C/svg%3E" )`
        , color: 'IndianRed' },
    { name: 'عرضه', colorLink:"DarkViolet", path:"productSupply" ,id: 8, icon:
            `url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg'  viewBox='10 -105 740 612'%3E%3Cpath d='M128 96c26.5 0 48-21.5 48-48S154.5 0 128 0 80 21.5 80 48s21.5 48 48 48zm384 0c26.5 0 48-21.5 48-48S538.5 0 512 0s-48 21.5-48 48 21.5 48 48 48zm125.7 372.1l-44-110-41.1 46.4-2 18.2 27.7 69.2c5 12.5 17 20.1 29.7 20.1 4 0 8-.7 11.9-2.3 16.4-6.6 24.4-25.2 17.8-41.6zm-34.2-209.8L585 178.1c-4.6-20-18.6-36.8-37.5-44.9-18.5-8-39-6.7-56.1 3.3-22.7 13.4-39.7 34.5-48.1 59.4L432 229.8 416 240v-96c0-8.8-7.2-16-16-16H240c-8.8 0-16 7.2-16 16v96l-16.1-10.2-11.3-33.9c-8.3-25-25.4-46-48.1-59.4-17.2-10-37.6-11.3-56.1-3.3-18.9 8.1-32.9 24.9-37.5 44.9l-18.4 80.2c-4.6 20 .7 41.2 14.4 56.7l67.2 75.9 10.1 92.6C130 499.8 143.8 512 160 512c1.2 0 2.3-.1 3.5-.2 17.6-1.9 30.2-17.7 28.3-35.3l-10.1-92.8c-1.5-13-6.9-25.1-15.6-35l-43.3-49 17.6-70.3 6.8 20.4c4.1 12.5 11.9 23.4 24.5 32.6l51.1 32.5c4.6 2.9 12.1 4.6 17.2 5h160c5.1-.4 12.6-2.1 17.2-5l51.1-32.5c12.6-9.2 20.4-20 24.5-32.6l6.8-20.4 17.6 70.3-43.3 49c-8.7 9.9-14.1 22-15.6 35l-10.1 92.8c-1.9 17.6 10.8 33.4 28.3 35.3 1.2.1 2.3.2 3.5.2 16.1 0 30-12.1 31.8-28.5l10.1-92.6 67.2-75.9c13.6-15.5 19-36.7 14.4-56.7zM46.3 358.1l-44 110c-6.6 16.4 1.4 35 17.8 41.6 16.8 6.6 35.1-1.7 41.6-17.8l27.7-69.2-2-18.2-41.1-46.4z' fill='DarkViolet' /%3E%3C/svg%3E" )`
        , color: 'Plum' },
    { name: 'حمل ونقل',colorLink:"DarkOliveGreen", path:"shippingList" , id: 9, icon:
            `url(${imgShipping})`
        , color: 'OliveDrab' },
    { name: ' سفارش', colorLink:"Salmon", path:"orderList" ,id: 10, icon:  `url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg'  viewBox='0 -3 20 20'   %3E%3Cpath d='M5.757 1.071a.5.5 0 0 1 .172.686L3.383 6h9.234L10.07 1.757a.5.5 0 1 1 .858-.514L13.783 6H15a1 1 0 0 1 1 1v1a1 1 0 0 1-1 1v4.5a2.5 2.5 0 0 1-2.5 2.5h-9A2.5 2.5 0 0 1 1 13.5V9a1 1 0 0 1-1-1V7a1 1 0 0 1 1-1h1.217L5.07 1.243a.5.5 0 0 1 .686-.172zM2 9v4.5A1.5 1.5 0 0 0 3.5 15h9a1.5 1.5 0 0 0 1.5-1.5V9H2zM1 7v1h14V7H1zm3 3a.5.5 0 0 1 .5.5v3a.5.5 0 0 1-1 0v-3A.5.5 0 0 1 4 10zm2 0a.5.5 0 0 1 .5.5v3a.5.5 0 0 1-1 0v-3A.5.5 0 0 1 6 10zm2 0a.5.5 0 0 1 .5.5v3a.5.5 0 0 1-1 0v-3A.5.5 0 0 1 8 10zm2 0a.5.5 0 0 1 .5.5v3a.5.5 0 0 1-1 0v-3a.5.5 0 0 1 .5-.5zm2 0a.5.5 0 0 1 .5.5v3a.5.5 0 0 1-1 0v-3a.5.5 0 0 1 .5-.5z' fill='Salmon' /%3E%3C/svg%3E" )`, color: ' LightSalmon' },
    // { name: '  جزییات سفارش', colorLink:"orange", path:"/userList" ,id: 11, icon: '', color: 'Lavender' },
    // { name: 'سبد خرید',colorLink:"orange", path:"/userList" , id: 12, icon: '', color: 'Thistle' },
    // { name: ' آدرس', colorLink:"orange", path:"/userList" ,id: 13, icon: '', color: 'PaleGreen' },
    // { name: ' مدارک', colorLink:"orange", path:"/userList" ,id: 14, icon: '', color: 'MediumTurquoise' },
    // { name: 'اعلان ها',colorLink:"orange", path:"/userList" , id: 15, icon: '', color: 'LightCyan' },
    { name: ' باربری',colorLink:"MediumTurquoise", path:"shippingcompanyList" , id: 16, icon: `url(${imgShippingCompany})`, color: 'Turquoise' },
    { name: ' قرارداد باربری',colorLink:"HotPink", path:"ShippingContract" , id: 17, icon:
            `url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg'  viewBox='-50 -50 484 612'%3E%3Cpath d='M224 136V0H24C10.7 0 0 10.7 0 24v464c0 13.3 10.7 24 24 24h336c13.3 0 24-10.7 24-24V160H248c-13.2 0-24-10.8-24-24zM64 72c0-4.42 3.58-8 8-8h80c4.42 0 8 3.58 8 8v16c0 4.42-3.58 8-8 8H72c-4.42 0-8-3.58-8-8V72zm0 64c0-4.42 3.58-8 8-8h80c4.42 0 8 3.58 8 8v16c0 4.42-3.58 8-8 8H72c-4.42 0-8-3.58-8-8v-16zm192.81 248H304c8.84 0 16 7.16 16 16s-7.16 16-16 16h-47.19c-16.45 0-31.27-9.14-38.64-23.86-2.95-5.92-8.09-6.52-10.17-6.52s-7.22.59-10.02 6.19l-7.67 15.34a15.986 15.986 0 0 1-14.31 8.84c-.38 0-.75-.02-1.14-.05-6.45-.45-12-4.75-14.03-10.89L144 354.59l-10.61 31.88c-5.89 17.66-22.38 29.53-41 29.53H80c-8.84 0-16-7.16-16-16s7.16-16 16-16h12.39c4.83 0 9.11-3.08 10.64-7.66l18.19-54.64c3.3-9.81 12.44-16.41 22.78-16.41s19.48 6.59 22.77 16.41l13.88 41.64c19.77-16.19 54.05-9.7 66 14.16 2.02 4.06 5.96 6.5 10.16 6.5zM377 105L279.1 7c-4.5-4.5-10.6-7-17-7H256v128h128v-6.1c0-6.3-2.5-12.4-7-16.9z' fill='HotPink' /%3E%3C/svg%3E" )`
        , color: 'Pink' }

]

// public enum EntityTypes
// {
//     Customer = 1,
//     Product,
//     Organization,
//     Warehouse,
//     ProductWareHouse,
//     Supply,
//     Supplier,
//     ProductSupply,
//     Shipping,
//     Order,
//     OrderDetail,
//     ShoppingCart,
//     Address,
//     Attachment,
//     News,ShippingCompany,     ShippingContract
// }